nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/osc/processor/osc_p32mx174f256d.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _OSC_P32MX174F256D_H
#define _OSC_P32MX174F256D_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    OSC_ID_0 = 0,
    OSC_NUMBER_OF_MODULES = 1

} OSC_MODULE_ID;

typedef enum {

    OSC_ON_WAIT_IDLE = 0x00,
    OSC_ON_WAIT_SLEEP = 0x01

} OSC_OPERATION_ON_WAIT;

typedef enum {

    OSC_FRC_DIV_256 = 0x07,
    OSC_FRC_DIV_64 = 0x06,
    OSC_FRC_DIV_32 = 0x05,
    OSC_FRC_DIV_16 = 0x04,
    OSC_FRC_DIV_8 = 0x03,
    OSC_FRC_DIV_4 = 0x02,
    OSC_FRC_DIV_2 = 0x01,
    OSC_FRC_DIV_1 = 0x00

} OSC_FRC_DIV;

typedef enum {

    OSC_FRC_WITH_PLL = 0x01,
    OSC_PRIMARY = 0x02,
    OSC_PRIMARY_WITH_PLL = 0x01,
    OSC_SECONDARY = 0x04,
    OSC_LPRC = 0x05,
    OSC_FRC_BY_FRCDIV = 0x00

} OSC_SYS_TYPE;

typedef enum {

    OSC_REF_BASECLOCK_SYSCLK = 0x08,
    OSC_REF_BASECLOCK_PBCLK = 0x07,
    OSC_REF_BASECLOCK_PRIMARY = 0x06,
    OSC_REF_BASECLOCK_FRC = 0x05,
    OSC_REF_BASECLOCK_LPRC = 0x04,
    OSC_REF_BASECLOCK_SOSC = 0x03,
    OSC_REF_BASECLOCK_USBCLK = 0x02,
    OSC_REF_BASECLOCK_SYSPLLOUT = 0x01,
    OSC_REF_BASECLOCK_EXT = 0x00

} OSC_REF_BASECLOCK;

typedef enum {

    SYS_OSC_USBCLK_PRIMARY = 0x00,
    SYS_OSC_USBCLK_FRC = 0x01

} OSC_USBCLOCK_SOURCE;

typedef enum {

    OSC_SYSPLL_OUT_DIV_16 = 0x07,
    OSC_SYSPLL_OUT_DIV_12 = 0x06,
    OSC_SYSPLL_OUT_DIV_8 = 0x05,
    OSC_SYSPLL_OUT_DIV_6 = 0x04,
    OSC_SYSPLL_OUT_DIV_4 = 0x03,
    OSC_SYSPLL_OUT_DIV_3 = 0x02,
    OSC_SYSPLL_OUT_DIV_2 = 0x01,
    OSC_SYSPLL_OUT_DIV_1 = 0x00

} OSC_SYSPLL_OUT_DIV;

typedef enum {

    OSC_UPLL_OUT_DIV_16 = 0x07,
    OSC_UPLL_OUT_DIV_12 = 0x06,
    OSC_UPLL_OUT_DIV_8 = 0x05,
    OSC_UPLL_OUT_DIV_6 = 0x04,
    OSC_UPLL_OUT_DIV_4 = 0x03,
    OSC_UPLL_OUT_DIV_3 = 0x02,
    OSC_UPLL_OUT_DIV_2 = 0x01,
    OSC_UPLL_OUT_DIV_1 = 0x00

} OSC_UPLL_OUT_DIV;

typedef enum {

    OSC_BTPLL_OUT_DIV_NONE

} OSC_BTPLL_OUT_DIV;

typedef enum {

    OSC_PLL_SELECT_NONE

} OSC_PLL_SELECT;

typedef enum {

    OSC_PERIPHERAL_BUS_1 = 0x00

} OSC_PERIPHERAL_BUS;

typedef enum {

    OSC_REFERENCE_1 = 0x00

} OSC_REFERENCE;

typedef enum {

    OSC_SYSPLL_IN_DIV_12 = 0x07,
    OSC_SYSPLL_IN_DIV_10 = 0x06,
    OSC_SYSPLL_IN_DIV_6 = 0x05,
    OSC_SYSPLL_IN_DIV_5 = 0x04,
    OSC_SYSPLL_IN_DIV_4 = 0x03,
    OSC_SYSPLL_IN_DIV_3 = 0x02,
    OSC_SYSPLL_IN_DIV_2 = 0x01,
    OSC_SYSPLL_IN_DIV_1 = 0x00

} OSC_SYSPLL_IN_DIV;

typedef enum {

    OSC_UPLL_IN_DIV_12 = 0x07,
    OSC_UPLL_IN_DIV_10 = 0x06,
    OSC_UPLL_IN_DIV_6 = 0x05,
    OSC_UPLL_IN_DIV_5 = 0x04,
    OSC_UPLL_IN_DIV_4 = 0x03,
    OSC_UPLL_IN_DIV_3 = 0x02,
    OSC_UPLL_IN_DIV_2 = 0x01,
    OSC_UPLL_IN_DIV_1 = 0x00

} OSC_UPLL_IN_DIV;

typedef enum {

    OSC_BTPLL_IN_DIV_NONE

} OSC_BTPLL_IN_DIV;

typedef enum {

    OSC_SYSPLL_FREQ_RANGE_NONE

} OSC_SYSPLL_FREQ_RANGE;

typedef enum {

    OSC_SYSPLL_IN_CLK_SOURCE_FRC = 0x1,
    OSC_SYSPLL_IN_CLK_SOURCE_PRIMARY = 0x0

} OSC_SYSPLL_IN_CLK_SOURCE;

typedef enum {

    OSC_UPLL_FREQ_RANGE_NONE

} OSC_UPLL_FREQ_RANGE;

typedef enum {

    OSC_BTPLL_FREQ_RANGE_NONE

} OSC_BTPLL_FREQ_RANGE;

typedef enum {

    OSC_BTPLL_IN_CLK_SOURCE_NONE

} OSC_BTPLL_IN_CLK_SOURCE;

typedef enum {

    OSC_SLEEP_TO_STARTUP_CLK_FRC = 0x1,
    OSC_SLEEP_TO_STARTUP_NO_ADDITIONAL_CLK = 0x0

} OSC_SLEEP_TO_STARTUP_CLK_TYPE;

typedef enum {

    OSC_CLOCK_FAST_RC = 0x0,
    OSC_CLOCK_PRIMARY_OSC = 0x2,
    OSC_CLOCK_SECONDARY_OSC = 0x4,
    OSC_CLOCK_LOW_POWER_RC = 0x5,
    OSC_CLOCK_USB_PLL = 0x8,
    OSC_CLOCK_SYSTEM_PLL = 0x1

} OSC_CLOCK_ID;

typedef enum {

    OSC_CLOCK_DIAG_NONE

} OSC_CLOCK_DIAG;

typedef enum {

    OSC_CLOCK_SLEW_TYPE_NONE

} OSC_CLOCK_SLEW_TYPE;

/* Section 2 - Feature variant inclusion */

#define PLIB_TEMPLATE PLIB_INLINE
#include "../templates/osc_OnWaitAction_Default.h"
#include "../templates/osc_SecondaryEnable_Default.h"
#include "../templates/osc_SecondaryReady_Default_1.h"
#include "../templates/osc_FRCDivisor_Default.h"
#include "../templates/osc_OscSelect_Default.h"
#include "../templates/osc_OscSwitchInit_Default.h"
#include "../templates/osc_OscCurrentGet_PIC32_1.h"
#include "../templates/osc_PBClockDivisor_PIC32MX_XLP.h"
#include "../templates/osc_PBClockReady_PIC32MX_XLP.h"
#include "../templates/osc_UsbClockSource_Default.h"
#include "../templates/osc_PLLLockStatus_Unsupported.h"
#include "../templates/osc_PLLClockLock_Default.h"
#include "../templates/osc_PLLMultiplier_PIC32MX_XLP.h"
#include "../templates/osc_UPLLMultiplier_PIC32MX_XLP.h"
#include "../templates/osc_BTPLLMultiplier_Unsupported.h"
#include "../templates/osc_PLLOutputDivisor_PIC32MX_XLP.h"
#include "../templates/osc_UPLLOutputDivisor_PIC32MX_XLP.h"
#include "../templates/osc_BTPLLOutputDivisor_Unsupported.h"
#include "../templates/osc_ClockFail_Default.h"
#include "../templates/osc_FRCTuning_Default.h"
#include "../templates/osc_ReferenceOscBaseClock_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscChange_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscChangeActive_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscStopInSleep_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOutputEnable_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscStopInIdleEnable_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscEnable_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscDivisor_PIC32MX_XLP.h"
#include "../templates/osc_ReferenceOscTrim_PIC32MX_XLP.h"
#include "../templates/osc_PBClockOutputEnable_PIC32MX_XLP.h"
#include "../templates/osc_PLLInputDivisor_PIC32MX_XLP.h"
#include "../templates/osc_UPLLInputDivisor_PIC32MX_XLP.h"
#include "../templates/osc_BTPLLInputDivisor_Unsupported.h"
#include "../templates/osc_PLLInputClockSource_Default.h"
#include "../templates/osc_BTPLLInputClockSource_Unsupported.h"
#include "../templates/osc_PLLFrequencyRange_Unsupported.h"
#include "../templates/osc_BTPLLFrequencyRange_Unsupported.h"
#include "../templates/osc_UPLLFrequencyRange_Unsupported.h"
#include "../templates/osc_SleepToStartupClock_Default.h"
#include "../templates/osc_ClockReadyStatus_Default.h"
#include "../templates/osc_ClockDiagStatus_Unsupported.h"
#include "../templates/osc_ClockSlewingStatus_Unsupported.h"
#include "../templates/osc_SlewEnableControl_Unsupported.h"
#include "../templates/osc_SlewDivisorStepControl_Unsupported.h"
#include "../templates/osc_SystemClockDivisorControl_Unsupported.h"
#include "../templates/osc_DreamModeControl_Unsupported.h"
#include "../templates/osc_ForceLock_Unsupported.h"
#include "../templates/osc_ResetPLL_Unsupported.h"
#include "../templates/osc_PLLBypass_Unsupported.h"
#include "../templates/osc_BTPLLClockOut_Unsupported.h"

